package ru.job4j.calculator;

public class Calculator {
    public static void main(String[] args) {
        int one = 1;
        int two = 2;
        int four = 4;
        int five = 5;
        int six = 6;
        int onePlusTwo = one + two;
        int sixDivTwo = six / two;
        int fiveMinusTwo = five - two;
        int fourTimeTwo = four * two;
        System.out.println(onePlusTwo);
        System.out.println(sixDivTwo);
        System.out.println(fiveMinusTwo);
        System.out.println(fourTimeTwo);

        int size1 = 10;
        size1=100;
        size1=size1-5;
        System.out.println(size1);
    }
}
//1.В методе main создайте дополнительные переменные,кроме тех,что уже созданы.
//        -переменную типа int c именем six и значением 6.
//        -переменную типа int c именем four и значением 4.
//        -переменную типа int с именем five и значением 5.
//
//        2.Создайте еще три переменные для хранения результата арифметических операций.
//        -переменную типа int c именем sixDivTwo и присвойте ей значение арифметической операции деления переменной six на two.
//        -переменную типа int c именем fiveMinusTwo и присвойте ей значение арифметической операции вычитания переменной five c two.
//        -переменную типа int c именем fourTimeTwo и присвойте ей значение арифметической операции умножения переменной four на two.
//
//        3.Выведите на консоль переменные sixDivTwo,fiveMinusTwo,fourTimeTwo.
//        4.Загрузите файл ru.job4j.calculator.Calculator на сайт github.com и оставьте ссылку на изменения.

//1. В комментарии к этой задаче напишите код.
//
//        В коде нужно объявить переменную size типа int и присвоить ей значение 10.
//
//        Далее нужно назначить этой же переменной значение 100.
//
//        Потом нужно отнять от переменной size число 5, и результат записать опять в переменную size.
//
//        В вашем коде будет создана только одна переменная size.

